In [25]:
import pandas as pd

In [26]:
df = pd.read_csv('csv files/Car_sales.csv')

df=df[['Manufacturer', 'Sales_in_thousands', 'Vehicle_type', 'Price_in_thousands','Engine_size', 'Horsepower', 'Fuel_capacity']]
df

,Manufacturer,Sales_in_thousands,Vehicle_type,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
0,Acura,16.919,Passenger,21.50,1.8,140.0,13.2
1,Acura,39.384,Passenger,28.40,3.2,225.0,17.2
2,Acura,14.114,Passenger,NaN,3.2,225.0,17.2
3,Acura,8.588,Passenger,42.00,3.5,210.0,18.0
4,Audi,20.397,Passenger,23.99,1.8,150.0,16.4
...,...,...,...,...,...,...,...
152,Volvo,3.545,Passenger,24.40,1.9,160.0,15.8
153,Volvo,15.245,Passenger,27.50,2.4,168.0,17.9
154,Volvo,17.531,Passenger,28.80,2.4,168.0,17.9
155,Volvo,3.493,Passenger,45.50,2.3,236.0,18.5
156,Volvo,18.969,Passenger,36.00,2.9,201.0,21.1

In [27]:
df.nunique()

Manufacturer           30
Sales_in_thousands    157
Vehicle_type            2
Price_in_thousands    152
Engine_size            31
Horsepower             66
Fuel_capacity          55
dtype: int64

# 1 agg()

In [28]:
# calculate sum of rows
df.agg("sum")

Manufacturer          AcuraAcuraAcuraAcuraAudiAudiAudiBMWBMWBMWBuick...
Sales_in_thousands                                             8320.698
Vehicle_type          PassengerPassengerPassengerPassengerPassengerP...
Price_in_thousands                                             4245.567
Engine_size                                                       477.5
Horsepower                                                      29008.0
Fuel_capacity                                                    2800.5
dtype: object

In [29]:
# calculate mean of numeric columns
numeric_cols = df.select_dtypes(include=['number']).columns
df_numcols = df[numeric_cols]
df_numcols.agg("mean")

Sales_in_thousands     52.998076
Price_in_thousands     27.390755
Engine_size             3.060897
Horsepower            185.948718
Fuel_capacity          17.951923
dtype: float64

In [32]:
#calculate mean and count values
df_numcols.apply(['mean', 'count'])

,Sales_in_thousands,Price_in_thousands,Engine_size,Horsepower,Fuel_capacity
mean,52.998076,27.390755,3.060897,185.948718,17.951923
count,157.000000,155.000000,156.000000,156.000000,156.000000

In [34]:
# calculate mean and sum of Sales_in_thousands and the max of Price_in_thousands
df_numcols.agg({'Sales_in_thousands':['mean','sum'], 
                'Price_in_thousands':['max', 'sum']})

      Sales_in_thousands  Price_in_thousands
mean           52.998076                 NaN
sum          8320.698000            4245.567
max                  NaN              85.500

In [ ]:
# aggregate over columns